Autodesk.Revit.DB.HermiteFace.MixedDerivs
Mixed derivatives of the surface.

Autodesk.Revit.DB.HermiteFace.Tangents(System.Int32)
Tangents of the surface.

Autodesk.Revit.DB.HermiteFace.Points
Interpolation points of the surface.

Autodesk.Revit.DB.HermiteFace.Params(System.Int32)
Parameters of the surface.

Autodesk.Revit.DB.HermiteFace
A cubic hermite spline face of a 3d solid or open shell.
Remarks: Hermite faces are defined by cubic hermite spline surfaces bounded by edge loops.
The surfaces provide natural UV parameterization to the faces.